lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
#include "secure_bootstrap.h"
#include "phone_provisioning.h"
#include "panel_ui.h"
#include "panel_homey_dashboard_binding.h"
#include "panel_homey_favorites.h"
#include "athom_cloud_client.h"
#include "athom_oauth_runtime.h"
#include "athom_auth_store.h"
#include "panel_homey_alias_store.h"
#include "homey_panel_font_22.h"
#ifdef ESP_PLATFORM
#include "bsp/esp32_s3_touch_lcd_4b.h"
#include "driver/gpio.h"
#include "esp_check.h"
#include "esp_event.h"
#include "esp_http_server.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_random.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lvgl.h"
#include "lwip/sockets.h"
#include "nvs.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define AP_SSID "HomeyPanel-Setup"
#define BOOT_BUTTON_GPIO GPIO_NUM_0
#define WIPE_POLL_INTERVAL_MS 100
#define ROTATION_POLL_INTERVAL_MS 250
#define HOMEY_DASHBOARD_POLL_INTERVAL_MS 1000
#define MAX_FORM_BODY 512
#define QR_PAYLOAD_CAPACITY 96
#define DISPLAY_WIDTH 480
#define DISPLAY_MARGIN 18
#define TITLE_Y 12
#define DETAIL_Y 58
#define CODE_CAPTION_Y 134
#define CODE_Y 168
#define TOUCH_Y 214
#define QR_SIZE 180
#define QR_BOTTOM_MARGIN 8


static const char *TAG = "secure_bootstrap";
static const char PORTAL_SHARED_CSS[] =
    "body{font:18px system-ui;max-width:34rem;margin:2rem auto;padding:1rem;background:#f6f8fb;color:#16202a}"
    "main,.panel{background:#fff;border-radius:1rem;padding:1.4rem;box-shadow:0 .3rem 1.2rem rgba(0,0,0,.08)}"
    "h1,h2{margin-top:0}p{line-height:1.5}label{display:block;margin:.7rem 0}"
    "select,input,button{box-sizing:border-box;font:inherit;width:100%;padding:.7rem;margin:.4rem 0;border-radius:.55rem}"
    "button{white-space:normal;line-height:1.25;min-height:3.2rem;border:0;background:#1f5f99;color:#fff;font-weight:650}"
    "button:disabled{opacity:.45;cursor:not-allowed}.help{display:block;min-height:1.3em;color:#9b1c1c;font-size:.9rem}"
    ".check{display:flex;gap:.6rem;align-items:center}.check input{width:auto}.notice{padding:1rem;border-radius:.75rem;background:#eef5fb;margin:1rem 0}"
    ".testmode{padding:1rem;border-radius:.75rem;background:#fff3cd;border:1px solid #e4bd53;margin:1rem 0}"
    ".pass{color:#146c43;font-weight:700}.fail{color:#b02a37;font-weight:700}.danger{background:#a61b29}.muted{color:#5b6670;font-size:.92rem}";

static const char *portal_shared_css(void) { return PORTAL_SHARED_CSS; }

static secure_bootstrap_code_t s_code;
static secure_bootstrap_wifi_context_t s_wifi;
static httpd_handle_t s_server;
static bool s_homey_handlers_registered;
static esp_netif_t *s_ap_netif;
static esp_netif_t *s_sta_netif;
static lv_obj_t *s_title;
static lv_obj_t *s_detail;
static lv_obj_t *s_code_caption;
static lv_obj_t *s_code_label;
static lv_obj_t *s_qr;
static lv_obj_t *s_touch_button;
static lv_obj_t *s_provisioning_screen;
static panel_ui_model_t s_panel_model;
static panel_ui_t *s_panel_ui;
static panel_homey_dashboard_state_t s_homey_dashboard_state;
static uint64_t s_homey_dashboard_last_poll_ms;
static bool s_panel_dashboard_visible;
static uint64_t s_homey_data_wait_started_ms;
static athom_homey_data_state_t s_homey_data_rendered_state = (athom_homey_data_state_t)255;
static bool s_homey_data_long_wait_rendered;
static bool s_homey_phone_runtime_ready_seen;

typedef struct {
    uint64_t refresh_start_us;
    uint64_t flush_start_us;
    uint64_t window_start_us;
    uint64_t refresh_total_us;
    uint64_t refresh_max_us;
    uint64_t flush_total_us;
    uint64_t flush_max_us;
    uint32_t refresh_count;
    uint32_t flush_count;
} panel_display_perf_t;

static panel_display_perf_t s_panel_perf;

static void panel_display_perf_event(lv_event_t *event)
{
    const uint64_t now = (uint64_t)esp_timer_get_time();
    switch (lv_event_get_code(event)) {
    case LV_EVENT_REFR_START:
        s_panel_perf.refresh_start_us = now;
        break;
    case LV_EVENT_REFR_READY:
        if (s_panel_perf.refresh_start_us != 0U) {
            uint64_t elapsed = now - s_panel_perf.refresh_start_us;
            s_panel_perf.refresh_total_us += elapsed;
            if (elapsed > s_panel_perf.refresh_max_us) s_panel_perf.refresh_max_us = elapsed;
            s_panel_perf.refresh_count++;
            s_panel_perf.refresh_start_us = 0U;
        }
        break;
    case LV_EVENT_FLUSH_START:
        s_panel_perf.flush_start_us = now;
        break;
    case LV_EVENT_FLUSH_FINISH:
        if (s_panel_perf.flush_start_us != 0U) {
            uint64_t elapsed = now - s_panel_perf.flush_start_us;
            s_panel_perf.flush_total_us += elapsed;
            if (elapsed > s_panel_perf.flush_max_us) s_panel_perf.flush_max_us = elapsed;
            s_panel_perf.flush_count++;
            s_panel_perf.flush_start_us = 0U;
        }
        break;
    default:
        break;
    }
}

static void panel_display_perf_log_if_due(void)
{
    const uint64_t now = (uint64_t)esp_timer_get_time();
    if (s_panel_perf.window_start_us == 0U) s_panel_perf.window_start_us = now;
    uint64_t window_us = now - s_panel_perf.window_start_us;
    if (window_us < 5000000ULL) return;
    uint64_t refresh_avg = s_panel_perf.refresh_count == 0U ? 0U :
        s_panel_perf.refresh_total_us / s_panel_perf.refresh_count;
    uint64_t flush_avg = s_panel_perf.flush_count == 0U ? 0U :
        s_panel_perf.flush_total_us / s_panel_perf.flush_count;
    ESP_LOGI(TAG, "PANEL_PERF window_ms=%llu refresh_count=%lu refresh_avg_us=%llu refresh_max_us=%llu flush_count=%lu flush_avg_us=%llu flush_max_us=%llu",
        (unsigned long long)(window_us / 1000ULL),
        (unsigned long)s_panel_perf.refresh_count,
        (unsigned long long)refresh_avg,
        (unsigned long long)s_panel_perf.refresh_max_us,
        (unsigned long)s_panel_perf.flush_count,
        (unsigned long long)flush_avg,
        (unsigned long long)s_panel_perf.flush_max_us);
    s_panel_perf.window_start_us = now;
    s_panel_perf.refresh_total_us = 0U;
    s_panel_perf.refresh_max_us = 0U;
    s_panel_perf.flush_total_us = 0U;
    s_panel_perf.flush_max_us = 0U;
    s_panel_perf.refresh_count = 0U;
    s_panel_perf.flush_count = 0U;
}
static wifi_config_t s_saved_config, s_candidate_config;
static secure_bootstrap_network_t s_networks[SECURE_BOOTSTRAP_MAX_NETWORKS];
static size_t s_network_count;
static bool s_scan_in_progress;
static bool s_saved_valid, s_candidate_valid, s_ip_obtained;
static bool s_wifi_nvs_enabled;
typedef enum {
    WIFI_PERSIST_STAGE_IDLE = 0,
    WIFI_PERSIST_STAGE_WRITING,
    WIFI_PERSIST_STAGE_VERIFY_CONNECT,
    WIFI_PERSIST_STAGE_ROLLBACK,
} wifi_persist_stage_t;
static bool s_persist_task_scheduled;
static bool s_persist_active;
static bool s_rollback_attempted;
static bool s_reconfigure_pending;
static wifi_persist_stage_t s_persist_stage;
static int64_t s_last_code_countdown_s = -1;

static int64_t now_s(void) { return esp_timer_get_time() / 1000000LL; }
static void secure_zero(void *buffer, size_t size) { volatile unsigned char *p = buffer; while (size--) *p++ = 0U; }
static bool has_saved_ssid(const wifi_config_t *config) { return config != NULL && config->sta.ssid[0] != 0U; }
static bool ssid_has_any_nonzero(const wifi_config_t *config)
{
    if (config == NULL) return false;
    for (size_t i = 0; i < sizeof(config->sta.ssid); ++i) {
        if (config->sta.ssid[i] != 0U) return true;
    }
    return false;
}

static void format_code_caption(char *caption, size_t caption_size, int64_t current_s)
{
    int64_t remaining_s =
        s_code.issued_at_s + SECURE_BOOTSTRAP_CODE_TTL_SECONDS - current_s;
    if (remaining_s < 0) {
        remaining_s = 0;
    }
    int64_t minutes = remaining_s / 60;
    int64_t seconds = remaining_s % 60;
    (void)snprintf(
        caption,
        caption_size,
        "Panelkod (%02lld:%02lld):",
        (long long)minutes,
        (long long)seconds);
}

