lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static void refresh_code_countdown(void)
{
    if (s_wifi.state != SECURE_BOOTSTRAP_WIFI_PROVISIONING ||
        s_code.code[0] == '\0') {
        s_last_code_countdown_s = -1;
        return;
    }

    int64_t current_s = now_s();
    int64_t remaining_s =
        s_code.issued_at_s + SECURE_BOOTSTRAP_CODE_TTL_SECONDS - current_s;
    if (remaining_s < 0) {
        remaining_s = 0;
    }
    if (remaining_s == s_last_code_countdown_s) {
        return;
    }

    char caption[32];
    format_code_caption(caption, sizeof(caption), current_s);
    if (bsp_display_lock(1000)) {
        lv_label_set_text(s_code_caption, caption);
        bsp_display_unlock();
        s_last_code_countdown_s = remaining_s;
    }
    secure_zero(caption, sizeof(caption));
}

static void set_display_text(
    const char *title,
    const char *detail,
    const char *display_code)
{
    if (!bsp_display_lock(1000)) {
        return;
    }

    bool bootstrap_visible = display_code != NULL && display_code[0] != '\0';
    lv_label_set_text(s_title, title != NULL ? title : "");
    lv_label_set_text(s_detail, detail != NULL ? detail : "");
    if (bootstrap_visible) {
        char caption[32];
        format_code_caption(caption, sizeof(caption), now_s());
        lv_label_set_text(s_code_caption, caption);
        secure_zero(caption, sizeof(caption));
    } else {
        lv_label_set_text(s_code_caption, "");
        s_last_code_countdown_s = -1;
    }
    lv_label_set_text(s_code_label, display_code != NULL ? display_code : "");
    if (s_qr != NULL) {
        if (bootstrap_visible) {
            char payload[QR_PAYLOAD_CAPACITY];
            int written = snprintf(
                payload,
                sizeof(payload),
                "WIFI:T:WPA;S:%s;P:%s;;",
                AP_SSID,
                display_code);
            if (written > 0 && (size_t)written < sizeof(payload)) {
                lv_qrcode_update(s_qr, payload, (size_t)written);
                lv_obj_remove_flag(s_qr, LV_OBJ_FLAG_HIDDEN);
            } else {
                lv_obj_add_flag(s_qr, LV_OBJ_FLAG_HIDDEN);
            }
            secure_zero(payload, sizeof(payload));
        } else {
            lv_obj_add_flag(s_qr, LV_OBJ_FLAG_HIDDEN);
        }
    }

    bsp_display_unlock();
}

static esp_err_t apply_actions(uint32_t actions);
static void reconfigure_task(void *arg);
static void panel_interaction_trace(void *context, panel_ui_trace_event_t event, bool callback_present)
{
    (void)context;
    const char *name = event == PANEL_UI_TRACE_WIFI_CLICK ? "wifi_click" : "choose_homey_click";
    ESP_LOGI(TAG, "PANEL_UI interaction=%s callback_present=%s",
             name, callback_present ? "true" : "false");
}

static void panel_wifi_result_update(panel_ui_wifi_reconfigure_result_t result)
{
    if (s_panel_ui == NULL) return;
    if (!bsp_display_lock(50)) {
        ESP_LOGW(TAG, "PANEL_UI wifi_result_lock=false result=%u", (unsigned)result);
        return;
    }
    bool updated = panel_ui_set_wifi_reconfigure_result(s_panel_ui, result);
    bsp_display_unlock();
    ESP_LOGI(TAG, "PANEL_UI wifi_result=%u updated=%s",
             (unsigned)result, updated ? "true" : "false");
}

static void panel_brightness_request(void *context, uint8_t value)
{
    (void)context;
    const char *operation = value == 0U ? "off" : "set";
    ESP_LOGI(TAG, "PANEL_UI brightness_request=%u operation=%s",
             (unsigned)value, operation);
    const esp_err_t err = bsp_display_brightness_set((int)value);
    ESP_LOGI(TAG, "PANEL_UI backlight_driver=bsp-pwm");
    ESP_LOGI(TAG, "PANEL_UI brightness_result=%s", esp_err_to_name(err));
}

static void panel_wifi_request(void *context)
{
    (void)context;
    ESP_LOGI(TAG, "PANEL_UI wifi_reconfigure_callback=true state=%u pending=%s",
             (unsigned)s_wifi.state, s_reconfigure_pending ? "true" : "false");
    if (s_reconfigure_pending) {
        ESP_LOGW(TAG, "PANEL_UI wifi_reconfigure_blocked=pending");
        panel_wifi_result_update(PANEL_UI_WIFI_RECONFIGURE_BLOCKED);
        return;
    }
    if (s_wifi.state != SECURE_BOOTSTRAP_WIFI_ONLINE) {
        ESP_LOGW(TAG, "PANEL_UI wifi_reconfigure_blocked=state state=%u", (unsigned)s_wifi.state);
        panel_wifi_result_update(PANEL_UI_WIFI_RECONFIGURE_BLOCKED);
        return;
    }
    s_reconfigure_pending = true;
    if (xTaskCreate(reconfigure_task, "wifi_reconfigure", 4096, NULL, 5, NULL) != pdPASS) {
        s_reconfigure_pending = false;
        ESP_LOGE(TAG, "PANEL_UI wifi_reconfigure_task_create=false");
        panel_wifi_result_update(PANEL_UI_WIFI_RECONFIGURE_FAILED);
    } else {
        ESP_LOGI(TAG, "PANEL_UI wifi_reconfigure_task_create=true");
    }
}

static void panel_choose_request(void *context)
{
    (void)context;
    ESP_LOGI(TAG, "PANEL_UI choose_homey_supported=false package=3");
}

static void panel_wipe_request(void *context)
{
    (void)context;
    ESP_LOGI(TAG, "PANEL_UI homey_wipe_supported=false package=3 mutation=false");
}

static void panel_account_request(void *context)
{
    (void)context;
    ESP_LOGI(TAG, "PANEL_UI change_athom_supported=false package=3 mutation=false");
}

static void panel_settings_request(void *context, const panel_ui_settings_t *settings)
{
    (void)context;
    (void)settings;
    ESP_LOGI(TAG, "PANEL_UI settings_changed=true persistence=false package=3");
}

static bool panel_show_dashboard(void)
{
    if (s_panel_ui == NULL || !bsp_display_lock(1000)) return false;
    panel_ui_connection_info_t connection = {
        .state = PANEL_UI_CONNECTION_CONNECTED,
        .display_name = "",
    };
    (void)panel_homey_favorites_apply_ui_model(&s_panel_model);
    bool ok = panel_ui_activate(s_panel_ui);
    (void)panel_ui_set_connection(s_panel_ui, &connection);
    (void)panel_ui_set_time(s_panel_ui, NULL, false);
    (void)panel_ui_refresh(s_panel_ui);
    bsp_display_unlock();
    if (ok) s_panel_dashboard_visible = true;
    return ok;
}


static void update_homey_data_boot_view(uint64_t now_ms)
{
    if (s_wifi.state != SECURE_BOOTSTRAP_WIFI_ONLINE || s_panel_dashboard_visible) return;

    const athom_homey_data_state_t state = athom_oauth_runtime_homey_data_state();
    const bool phone_runtime_ready = phone_provisioning_homey_runtime_ready();
    const bool phone_runtime_ready_changed =
        phone_runtime_ready != s_homey_phone_runtime_ready_seen;
    if (s_homey_data_wait_started_ms == 0U && state != ATHOM_HOMEY_DATA_READY) {
        s_homey_data_wait_started_ms = now_ms;
    }

    if (state == ATHOM_HOMEY_DATA_READY) {
        ESP_LOGI(TAG, "HOMEY_DATA_UI phase=dashboard_show verified=true");
        (void)panel_show_dashboard();
        return;
    }

    const bool long_wait = s_homey_data_wait_started_ms != 0U &&
        now_ms - s_homey_data_wait_started_ms >= 30000ULL;
    const bool state_changed = state != s_homey_data_rendered_state;
    const bool long_wait_changed = long_wait != s_homey_data_long_wait_rendered;
    if (!state_changed && !long_wait_changed && !phone_runtime_ready_changed) return;

    if (state == ATHOM_HOMEY_DATA_ERROR) {
        set_display_text(
            "Homey-data kunde inte hämtas",
            "Kontrollera anslutningen eller Homey-inloggningen",
            NULL);
        ESP_LOGW(TAG, "HOMEY_DATA_UI state=error dashboard_visible=false");
    } else if (long_wait) {
        set_display_text(
            "Hämtningen tar längre tid än väntat",
            "Försöker igen...",
            NULL);
        ESP_LOGI(TAG, "HOMEY_DATA_UI state=long_wait dashboard_visible=false");
    } else {
        set_display_text(
            "Hämtar Homey-data...",
            "Väntar på verifierad live-data",
            NULL);
        ESP_LOGI(TAG, "HOMEY_DATA_UI state=loading dashboard_visible=false");
    }

    s_homey_data_rendered_state = state;
    s_homey_data_long_wait_rendered = long_wait;
    s_homey_phone_runtime_ready_seen = phone_runtime_ready;
}


