lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static void set_reconfigure_button_visible(bool visible)
{
    if (s_touch_button == NULL || !bsp_display_lock(1000)) {
        return;
    }
    if (visible) {
        lv_obj_remove_state(s_touch_button, LV_STATE_DISABLED);
        lv_obj_remove_flag(s_touch_button, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_state(s_touch_button, LV_STATE_DISABLED);
        lv_obj_add_flag(s_touch_button, LV_OBJ_FLAG_HIDDEN);
    }
    bsp_display_unlock();
}

static void reconfigure_task(void *arg)
{
    (void)arg;
    uint32_t actions = secure_bootstrap_wifi_transition(
        &s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_USER_RECONFIGURE);
    ESP_LOGI(TAG, "WIFI_RECONFIGURE transition_actions=0x%08lx", (unsigned long)actions);
    if ((actions & SECURE_BOOTSTRAP_WIFI_ACTION_OPEN_PROVISIONING) == 0U) {
        ESP_LOGW(TAG, "WIFI_RECONFIGURE open_provisioning=false actions=0x%08lx", (unsigned long)actions);
        s_reconfigure_pending = false;
        if (s_wifi.state == SECURE_BOOTSTRAP_WIFI_ONLINE) {
            set_reconfigure_button_visible(true);
        }
        panel_wifi_result_update(PANEL_UI_WIFI_RECONFIGURE_BLOCKED);
        vTaskDelete(NULL);
        return;
    }

    esp_err_t result = apply_actions(actions);
    ESP_LOGI(TAG, "WIFI_RECONFIGURE apply_result=%s", esp_err_to_name(result));
    panel_wifi_result_update(result == ESP_OK
        ? PANEL_UI_WIFI_RECONFIGURE_OPENED
        : PANEL_UI_WIFI_RECONFIGURE_FAILED);
    if (result != ESP_OK) {
        ESP_LOGE(TAG, "WIFI_RECONFIGURE open_result=%s", esp_err_to_name(result));
        uint32_t recovery = secure_bootstrap_wifi_transition(
            &s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_PROVISIONING_OPEN_FAILED);
        (void)apply_actions(recovery);
    } else {
        ESP_LOGI(TAG, "WIFI_RECONFIGURE requested=true");
    }
    vTaskDelete(NULL);
}

static void touch_event(lv_event_t *event)
{
    if (lv_event_get_code(event) != LV_EVENT_CLICKED ||
        s_reconfigure_pending ||
        s_wifi.state != SECURE_BOOTSTRAP_WIFI_ONLINE) {
        return;
    }

    s_reconfigure_pending = true;
    lv_obj_add_state(s_touch_button, LV_STATE_DISABLED);
    lv_obj_add_flag(s_touch_button, LV_OBJ_FLAG_HIDDEN);

    if (xTaskCreate(
            reconfigure_task,
            "wifi_reconfigure",
            4096,
            NULL,
            5,
            NULL) != pdPASS) {
        s_reconfigure_pending = false;
        lv_obj_remove_state(s_touch_button, LV_STATE_DISABLED);
        lv_obj_remove_flag(s_touch_button, LV_OBJ_FLAG_HIDDEN);
        ESP_LOGE(TAG, "WIFI_RECONFIGURE task_create=false");
    }
}

static esp_err_t connect_current(void) { esp_err_t err = esp_wifi_connect(); if (err != ESP_OK) ESP_LOGW(TAG, "Wi-Fi connect scheduling failed: %s", esp_err_to_name(err)); return err; }
static esp_err_t server_start(void);
static esp_err_t ensure_homey_server(void);
static esp_err_t open_provisioning(void);

#define WIFI_BACKUP_NAMESPACE "hpanel_wifi"
#define WIFI_BACKUP_KEY "backup_v1"
#define WIFI_SENTINEL_NAMESPACE "p007diag"
#define WIFI_SENTINEL_KEY "commit_seen"

static esp_err_t backup_clear(void)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(WIFI_BACKUP_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) return err;
    err = nvs_erase_key(handle, WIFI_BACKUP_KEY);
    if (err == ESP_ERR_NVS_NOT_FOUND) err = ESP_OK;
    if (err == ESP_OK) err = nvs_commit(handle);
    nvs_close(handle);
    ESP_LOGI(TAG, "WIFI_BACKUP clear_result=%s", esp_err_to_name(err));
    return err;
}

static void legacy_sentinel_clear(void)
{
    nvs_handle_t handle;
    if (nvs_open(WIFI_SENTINEL_NAMESPACE, NVS_READWRITE, &handle) != ESP_OK) return;
    esp_err_t err = nvs_erase_key(handle, WIFI_SENTINEL_KEY);
    if (err == ESP_OK) (void)nvs_commit(handle);
    nvs_close(handle);
}

static esp_err_t backup_write_saved(void)
{
    if (!s_saved_valid) return backup_clear();
    if (sizeof(wifi_config_t) > SECURE_BOOTSTRAP_WIFI_BACKUP_PAYLOAD_MAX) return ESP_ERR_INVALID_SIZE;
    secure_bootstrap_wifi_backup_blob_t blob;
    if (!secure_bootstrap_wifi_backup_encode(&blob, &s_saved_config, sizeof(s_saved_config))) return ESP_FAIL;
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(WIFI_BACKUP_NAMESPACE, NVS_READWRITE, &handle);
    if (err == ESP_OK) err = nvs_set_blob(handle, WIFI_BACKUP_KEY, &blob, sizeof(blob));
    if (err == ESP_OK) err = nvs_commit(handle);
    if (err == ESP_OK) {
        size_t size = sizeof(blob);
        secure_bootstrap_wifi_backup_blob_t verify;
        err = nvs_get_blob(handle, WIFI_BACKUP_KEY, &verify, &size);
        if (err == ESP_OK && !secure_bootstrap_wifi_backup_decode(&verify, &s_saved_config, sizeof(s_saved_config))) err = ESP_ERR_INVALID_CRC;
        secure_zero(&verify, sizeof(verify));
    }
    if (handle != 0) nvs_close(handle);
    secure_zero(&blob, sizeof(blob));
    ESP_LOGI(TAG, "WIFI_BACKUP write_result=%s", esp_err_to_name(err));
    return err;
}

static esp_err_t backup_read(wifi_config_t *config, bool *present)
{
    if (config == NULL || present == NULL) return ESP_ERR_INVALID_ARG;
    *present = false;
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WIFI_BACKUP_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) return ESP_OK;
    if (err != ESP_OK) return err;
    secure_bootstrap_wifi_backup_blob_t blob;
    size_t size = sizeof(blob);
    err = nvs_get_blob(handle, WIFI_BACKUP_KEY, &blob, &size);
    nvs_close(handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) return ESP_OK;
    if (err != ESP_OK || size != sizeof(blob) ||
        !secure_bootstrap_wifi_backup_decode(&blob, config, sizeof(*config)) ||
        !has_saved_ssid(config)) {
        secure_zero(&blob, sizeof(blob));
        secure_zero(config, sizeof(*config));
        return err == ESP_OK ? ESP_ERR_INVALID_CRC : err;
    }
    secure_zero(&blob, sizeof(blob));
    *present = true;
    return ESP_OK;
}

static esp_err_t driver_init_flash(void)
{
    wifi_init_config_t init = WIFI_INIT_CONFIG_DEFAULT();
    ESP_RETURN_ON_ERROR(esp_wifi_init(&init), TAG, "persist init");
    ESP_RETURN_ON_ERROR(esp_wifi_set_mode(WIFI_MODE_STA), TAG, "persist mode");
    return esp_wifi_set_storage(WIFI_STORAGE_FLASH);
}

static esp_err_t persist_write_and_reopen(wifi_config_t *config, wifi_config_t *readback)
{
    esp_err_t err = esp_wifi_stop();
    ESP_LOGI(TAG, "WIFI_PERSIST stop_result=%s", esp_err_to_name(err));
    if (err != ESP_OK && err != ESP_ERR_WIFI_NOT_STARTED) return err;
    err = esp_wifi_deinit();
    ESP_LOGI(TAG, "WIFI_PERSIST deinit_result=%s", esp_err_to_name(err));
    if (err != ESP_OK) return err;
    err = driver_init_flash();
    ESP_LOGI(TAG, "WIFI_PERSIST init_result=%s", esp_err_to_name(err));
    if (err != ESP_OK) return err;
    ESP_LOGI(TAG, "WIFI_PERSIST storage_result=%s", esp_err_to_name(ESP_OK));
    err = esp_wifi_set_config(WIFI_IF_STA, config);
    ESP_LOGI(TAG, "WIFI_PERSIST config_result=%s", esp_err_to_name(err));
    if (err != ESP_OK) return err;
    err = esp_wifi_deinit();
    ESP_LOGI(TAG, "WIFI_PERSIST verify_deinit_result=%s", esp_err_to_name(err));
    if (err != ESP_OK) return err;
    err = driver_init_flash();
    ESP_LOGI(TAG, "WIFI_PERSIST verify_init_result=%s", esp_err_to_name(err));
    if (err != ESP_OK) return err;
    memset(readback, 0, sizeof(*readback));
    err = esp_wifi_get_config(WIFI_IF_STA, readback);
    bool valid = err == ESP_OK && has_saved_ssid(readback);
    ESP_LOGI(TAG, "WIFI_PERSIST verify_get_result=%s", esp_err_to_name(err));
    ESP_LOGI(TAG, "WIFI_PERSIST verify_valid=%s", valid ? "true" : "false");
    return err != ESP_OK ? err : (valid ? ESP_OK : ESP_ERR_INVALID_STATE);
}

static void persist_fail(const char *step, esp_err_t err)
{
    ESP_LOGE(TAG, "WIFI_PERSIST failed step=%s result=%s", step, esp_err_to_name(err));
}

static esp_err_t rollback_once(void)
{
    if (s_rollback_attempted) return ESP_ERR_INVALID_STATE;
    s_rollback_attempted = true;
    s_persist_stage = WIFI_PERSIST_STAGE_ROLLBACK;
    ESP_LOGI(TAG, "WIFI_ROLLBACK begin");
    wifi_config_t backup = {0};
    wifi_config_t readback = {0};
    bool present = false;
    esp_err_t err = backup_read(&backup, &present);
    ESP_LOGI(TAG, "WIFI_ROLLBACK backup_present=%s", present ? "true" : "false");
    if (err != ESP_OK || !present) {
        secure_zero(&backup, sizeof(backup));
        return err != ESP_OK ? err : ESP_ERR_NOT_FOUND;
    }
    err = persist_write_and_reopen(&backup, &readback);
    ESP_LOGI(TAG, "WIFI_ROLLBACK restore_result=%s", esp_err_to_name(err));
    if (err == ESP_OK) {
        s_saved_config = readback;
        s_saved_valid = true;
        err = esp_wifi_start();
        if (err == ESP_OK) err = esp_wifi_connect();
        ESP_LOGI(TAG, "WIFI_ROLLBACK connect_result=%s", esp_err_to_name(err));
    }
    secure_zero(&backup, sizeof(backup));
    secure_zero(&readback, sizeof(readback));
    if (err == ESP_OK) ESP_LOGI(TAG, "WIFI_ROLLBACK complete");
    else ESP_LOGE(TAG, "WIFI_ROLLBACK failed step=restore result=%s", esp_err_to_name(err));
    return err;
}

static void persistent_commit_task(void *arg)
{
    (void)arg;
    s_persist_active = true;
    s_persist_stage = WIFI_PERSIST_STAGE_WRITING;
    ESP_LOGI(TAG, "WIFI_PERSIST begin");
    if (s_server != NULL) { (void)httpd_stop(s_server); s_server = NULL; }
    esp_err_t err = backup_write_saved();
    ESP_LOGI(TAG, "WIFI_PERSIST backup_result=%s", esp_err_to_name(err));
    wifi_config_t readback = {0};
    if (err == ESP_OK) err = persist_write_and_reopen(&s_candidate_config, &readback);
    if (err == ESP_OK) {
        s_saved_config = readback;
        s_saved_valid = true;
        uint32_t actions = secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_PERSIST_COMMIT_OK);
        (void)actions;
        s_persist_stage = WIFI_PERSIST_STAGE_VERIFY_CONNECT;
        err = esp_wifi_start();
        ESP_LOGI(TAG, "WIFI_PERSIST start_result=%s", esp_err_to_name(err));
        if (err == ESP_OK) err = esp_wifi_connect();
        ESP_LOGI(TAG, "WIFI_PERSIST connect_result=%s", esp_err_to_name(err));
        if (err == ESP_OK) { secure_zero(&readback, sizeof(readback)); vTaskDelete(NULL); return; }
    }
    persist_fail("commit", err);
    (void)secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_PERSIST_COMMIT_FAILED);
    esp_err_t rollback_err = rollback_once();
    if (rollback_err == ESP_OK) {
        (void)secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_ROLLBACK_OK);
        s_persist_active = false;
    } else {
        (void)secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_ROLLBACK_FAILED);
        s_persist_active = false;
        if (esp_wifi_start() == ESP_OK) (void)open_provisioning();
    }
    secure_zero(&readback, sizeof(readback));
    vTaskDelete(NULL);
}

