lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static esp_err_t schedule_persistent_commit(void)
{
    if (s_persist_task_scheduled || s_persist_active) return ESP_ERR_INVALID_STATE;
    s_persist_task_scheduled = true;
    if (xTaskCreate(persistent_commit_task, "wifi_persist", 6144, NULL, 5, NULL) != pdPASS) {
        s_persist_task_scheduled = false;
        return ESP_ERR_NO_MEM;
    }
    ESP_LOGI(TAG, "WIFI_PERSIST scheduled=true");
    return ESP_OK;
}

static esp_err_t configure_access_point(const char *password)
{
    wifi_config_t ap = {0};
    if (!password || strlen(password) != SECURE_BOOTSTRAP_CODE_LEN) return ESP_ERR_INVALID_ARG;
    snprintf((char *)ap.ap.ssid, sizeof(ap.ap.ssid), "%s", AP_SSID);
    snprintf((char *)ap.ap.password, sizeof(ap.ap.password), "%s", password);
    ap.ap.ssid_len = strlen(AP_SSID); ap.ap.channel = 1; ap.ap.max_connection = 2; ap.ap.authmode = WIFI_AUTH_WPA2_PSK;
    esp_err_t err = esp_wifi_set_config(WIFI_IF_AP, &ap); secure_zero(&ap, sizeof(ap)); return err;
}

static esp_err_t generate_code(void)
{
    uint8_t random_bytes[SECURE_BOOTSTRAP_CODE_LEN]; esp_fill_random(random_bytes, sizeof(random_bytes));
    secure_bootstrap_status_t r = secure_bootstrap_code_generate(&s_code, now_s(), random_bytes, sizeof(random_bytes));
    secure_zero(random_bytes, sizeof(random_bytes)); return r == SECURE_BOOTSTRAP_OK ? ESP_OK : ESP_FAIL;
}

static esp_err_t start_network_scan(void);
static size_t consume_network_scan_results(void);

static esp_err_t open_provisioning(void)
{
    phone_provisioning_on_wifi_offline();
    ESP_LOGI(TAG, "WIFI_TRACE portal_begin");
    if (s_code.code[0] == '\0' || s_code.consumed) {
        if (generate_code() != ESP_OK) {
            return ESP_FAIL;
        }
    }

    set_display_text(
        "Säker Wi-Fi-installation",
        "Anslut till HomeyPanel-Setup\nÖppna 192.168.4.1",
        s_code.code);
    ESP_RETURN_ON_ERROR(esp_wifi_set_mode(WIFI_MODE_APSTA), TAG, "APSTA mode");
    ESP_RETURN_ON_ERROR(configure_access_point(s_code.code), TAG, "AP config");
    ESP_RETURN_ON_ERROR(ensure_homey_server(), TAG, "Homey provisioning server");
    (void)start_network_scan();
    ESP_LOGI(
        TAG,
        "WIFI_PROVISIONING_OPEN networks=%u sensitive_values_logged=false",
        (unsigned)s_network_count);
    ESP_LOGI(TAG, "WIFI_TRACE provisioning_ready");
    return ESP_OK;
}

static void close_provisioning(void)
{
    if (s_server) { httpd_stop(s_server); s_server = NULL; }
    s_homey_handlers_registered = false;
    (void)esp_wifi_set_mode(WIFI_MODE_STA);
    secure_bootstrap_code_wipe(&s_code);
}

static esp_err_t restore_saved_ram(void)
{
    if (!s_saved_valid) return ESP_ERR_NOT_FOUND;
    ESP_RETURN_ON_ERROR(esp_wifi_set_storage(WIFI_STORAGE_RAM), TAG, "RAM storage");
    return esp_wifi_set_config(WIFI_IF_STA, &s_saved_config);
}

static esp_err_t apply_actions(uint32_t actions)
{
    esp_err_t err = ESP_OK;
    if (actions & SECURE_BOOTSTRAP_WIFI_ACTION_RESTORE_SAVED) {
        err = restore_saved_ram();
        if (err != ESP_OK) return err;
        s_candidate_valid = false;
        secure_zero(&s_candidate_config, sizeof(s_candidate_config));
    }
    if (actions & SECURE_BOOTSTRAP_WIFI_ACTION_OPEN_PROVISIONING) {
        set_reconfigure_button_visible(false);
        err = open_provisioning();
        if (err != ESP_OK) return err;
    }
    if (actions & SECURE_BOOTSTRAP_WIFI_ACTION_CONNECT) {
        err = connect_current();
        if (err != ESP_OK) return err;
    }
    if (actions & SECURE_BOOTSTRAP_WIFI_ACTION_START_PERSIST) {
        err = schedule_persistent_commit();
        if (err != ESP_OK) return err;
    }
    if (actions & SECURE_BOOTSTRAP_WIFI_ACTION_CLOSE_PROVISIONING) close_provisioning();
    if (actions & SECURE_BOOTSTRAP_WIFI_ACTION_SHOW_ONLINE) {
        err = ensure_homey_server();
        if (err != ESP_OK) return err;
        ESP_LOGI(TAG, "PHONE_PROV lan_portal_ready=true");
        s_reconfigure_pending = false;
        phone_provisioning_on_wifi_online();
        set_reconfigure_button_visible(true);
        update_homey_data_boot_view((uint64_t)(esp_timer_get_time() / 1000LL));
    }
    return ESP_OK;
}


static esp_err_t display_init(void)
{
    lv_display_t *display = bsp_display_start();
    if (display == NULL) {
        return ESP_FAIL;
    }

    ESP_RETURN_ON_ERROR(bsp_display_brightness_set(80), TAG, "display brightness");

    memset(&s_panel_perf, 0, sizeof(s_panel_perf));
    s_panel_perf.window_start_us = (uint64_t)esp_timer_get_time();
    lv_display_add_event_cb(display, panel_display_perf_event, LV_EVENT_REFR_START, NULL);
    lv_display_add_event_cb(display, panel_display_perf_event, LV_EVENT_REFR_READY, NULL);
    lv_display_add_event_cb(display, panel_display_perf_event, LV_EVENT_FLUSH_START, NULL);
    lv_display_add_event_cb(display, panel_display_perf_event, LV_EVENT_FLUSH_FINISH, NULL);

    lv_indev_t *input_device = bsp_display_get_input_dev();
    if (input_device != NULL) {
        lv_indev_set_scroll_limit(input_device, 4);
        lv_indev_set_scroll_throw(input_device, 4);
        ESP_LOGI(TAG, "PANEL_UI indev_scroll_limit=4 indev_scroll_throw=4");
    } else {
        ESP_LOGW(TAG, "PANEL_UI input_device_available=false");
    }

    if (!bsp_display_lock(0)) {
        return ESP_FAIL;
    }

    lv_obj_t *screen = lv_screen_active();
    s_provisioning_screen = screen;
    lv_obj_set_style_bg_color(screen, lv_color_hex(0x071018), 0);
    lv_obj_set_style_bg_opa(screen, LV_OPA_COVER, 0);
    lv_obj_set_style_text_color(screen, lv_color_hex(0xFFFFFF), 0);
    lv_obj_set_style_text_opa(screen, LV_OPA_COVER, 0);

    s_title = lv_label_create(screen);
    lv_label_set_text(s_title, "");
    lv_obj_set_width(s_title, DISPLAY_WIDTH - (2 * DISPLAY_MARGIN));
    lv_obj_align(s_title, LV_ALIGN_TOP_MID, 0, TITLE_Y);
    lv_label_set_long_mode(s_title, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_align(s_title, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(s_title, lv_color_hex(0xFFFFFF), 0);
    lv_obj_set_style_text_opa(s_title, LV_OPA_COVER, 0);
    lv_obj_set_style_text_font(s_title, &homey_panel_font_22, 0);

    s_detail = lv_label_create(screen);
    lv_label_set_text(s_detail, "");
    lv_obj_set_width(s_detail, DISPLAY_WIDTH - (2 * DISPLAY_MARGIN));
    lv_obj_align(s_detail, LV_ALIGN_TOP_MID, 0, DETAIL_Y);
    lv_label_set_long_mode(s_detail, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_align(s_detail, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(s_detail, lv_color_hex(0xF4F7FA), 0);
    lv_obj_set_style_text_opa(s_detail, LV_OPA_COVER, 0);
    lv_obj_set_style_text_line_space(s_detail, 5, 0);
    lv_obj_set_style_text_font(s_detail, &homey_panel_font_22, 0);

    s_code_caption = lv_label_create(screen);
    lv_label_set_text(s_code_caption, "");
    lv_obj_set_width(s_code_caption, DISPLAY_WIDTH - (2 * DISPLAY_MARGIN));
    lv_obj_align(s_code_caption, LV_ALIGN_TOP_MID, 0, CODE_CAPTION_Y);
    lv_obj_set_style_text_align(s_code_caption, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(s_code_caption, lv_color_hex(0xF4F7FA), 0);
    lv_obj_set_style_text_opa(s_code_caption, LV_OPA_COVER, 0);
    lv_obj_set_style_text_font(s_code_caption, &homey_panel_font_22, 0);

    s_code_label = lv_label_create(screen);
    lv_label_set_text(s_code_label, "");
    lv_obj_set_width(s_code_label, DISPLAY_WIDTH - (2 * DISPLAY_MARGIN));
    lv_obj_align(s_code_label, LV_ALIGN_TOP_MID, 0, CODE_Y);
    lv_obj_set_style_text_align(s_code_label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(s_code_label, lv_color_hex(0xFFFFFF), 0);
    lv_obj_set_style_text_opa(s_code_label, LV_OPA_COVER, 0);
    lv_obj_set_style_text_font(s_code_label, &lv_font_montserrat_28, 0);

    s_touch_button = lv_button_create(screen);
    lv_obj_set_size(s_touch_button, 190, 52);
    lv_obj_align(s_touch_button, LV_ALIGN_TOP_MID, 0, TOUCH_Y);
    lv_obj_set_style_bg_color(s_touch_button, lv_color_hex(0x1976D2), 0);
    lv_obj_set_style_bg_opa(s_touch_button, LV_OPA_COVER, 0);
    lv_obj_add_event_cb(s_touch_button, touch_event, LV_EVENT_CLICKED, NULL);
    lv_obj_t *touch_label = lv_label_create(s_touch_button);
    lv_label_set_text(touch_label, "Ändra Wi-Fi");
    lv_obj_set_style_text_color(touch_label, lv_color_hex(0xFFFFFF), 0);
    lv_obj_set_style_text_opa(touch_label, LV_OPA_COVER, 0);
    lv_obj_set_style_text_font(touch_label, &homey_panel_font_22, 0);
    lv_obj_center(touch_label);
    lv_obj_add_flag(s_touch_button, LV_OBJ_FLAG_HIDDEN);

    s_qr = lv_qrcode_create(screen);
    if (s_qr != NULL) {
        lv_qrcode_set_size(s_qr, QR_SIZE);
        lv_obj_align(s_qr, LV_ALIGN_BOTTOM_MID, 0, -QR_BOTTOM_MARGIN);
        lv_obj_add_flag(s_qr, LV_OBJ_FLAG_HIDDEN);
    }

    panel_ui_model_init(&s_panel_model, (uint64_t)(esp_timer_get_time() / 1000LL));
    panel_homey_dashboard_state_init(&s_homey_dashboard_state);
    s_homey_dashboard_last_poll_ms = 0U;
    panel_ui_config_t panel_config = {
        .model = &s_panel_model,
        .callbacks = {
            .context = NULL,
            .request_brightness = panel_brightness_request,
            .request_wifi_reconfigure = panel_wifi_request,
            .request_choose_homey = panel_choose_request,
            .request_homey_wipe = panel_wipe_request,
            .request_change_athom_account = panel_account_request,
            .settings_changed = panel_settings_request,
            .interaction_trace = panel_interaction_trace,
        },
    };
    ESP_LOGI(TAG, "PANEL_UI callbacks wifi=%s choose=%s wipe=%s account=%s trace=%s",
        panel_config.callbacks.request_wifi_reconfigure != NULL ? "true" : "false",
        panel_config.callbacks.request_choose_homey != NULL ? "true" : "false",
        panel_config.callbacks.request_homey_wipe != NULL ? "true" : "false",
        panel_config.callbacks.request_change_athom_account != NULL ? "true" : "false",
        panel_config.callbacks.interaction_trace != NULL ? "true" : "false");
    if (!panel_ui_create(&s_panel_ui, &panel_config)) {
        bsp_display_unlock();
        return ESP_FAIL;
    }

    bsp_display_unlock();
    return ESP_OK;
}

static secure_bootstrap_wifi_security_t map_auth(wifi_auth_mode_t mode)
{
    if (mode == WIFI_AUTH_OPEN) return SECURE_BOOTSTRAP_WIFI_SECURITY_OPEN;
    if (mode == WIFI_AUTH_WEP) return SECURE_BOOTSTRAP_WIFI_SECURITY_WEP;
    if (mode == WIFI_AUTH_WPA_PSK) return SECURE_BOOTSTRAP_WIFI_SECURITY_WPA;
    if (mode == WIFI_AUTH_WPA2_PSK || mode == WIFI_AUTH_WPA_WPA2_PSK) return SECURE_BOOTSTRAP_WIFI_SECURITY_WPA2;
    if (mode >= WIFI_AUTH_WPA3_PSK) return SECURE_BOOTSTRAP_WIFI_SECURITY_WPA3;
    return SECURE_BOOTSTRAP_WIFI_SECURITY_UNKNOWN;
}

