lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static esp_err_t start_network_scan(void)
{
    if (s_scan_in_progress) {
        return ESP_OK;
    }

    wifi_scan_config_t config = {
        .show_hidden = false,
    };
    s_scan_in_progress = true;
    ESP_LOGI(TAG, "WIFI_TRACE scan_start_begin");
    esp_err_t err = esp_wifi_scan_start(&config, false);
    ESP_LOGI(TAG, "WIFI_TRACE scan_start_end result=%s", esp_err_to_name(err));
    if (err != ESP_OK) {
        s_scan_in_progress = false;
        ESP_LOGW(TAG, "Wi-Fi scan start failed: %s", esp_err_to_name(err));
    }
    return err;
}

static size_t consume_network_scan_results(void)
{
    s_scan_in_progress = false;

    uint16_t total = 0U;
    esp_err_t err = esp_wifi_scan_get_ap_num(&total);
    if (err != ESP_OK || total == 0U) {
        memset(s_networks, 0, sizeof(s_networks));
        s_network_count = 0U;
        ESP_LOGI(TAG, "WIFI_TRACE scan_results_consumed count=0 result=%s", esp_err_to_name(err));
        return 0U;
    }
    if (total > 64U) {
        total = 64U;
    }

    wifi_ap_record_t *records = calloc(total, sizeof(*records));
    if (records == NULL) {
        ESP_LOGE(TAG, "Wi-Fi scan result allocation failed");
        return s_network_count;
    }

    uint16_t fetched = total;
    err = esp_wifi_scan_get_ap_records(&fetched, records);
    if (err != ESP_OK) {
        secure_zero(records, total * sizeof(*records));
        free(records);
        ESP_LOGW(TAG, "Wi-Fi scan result read failed: %s", esp_err_to_name(err));
        return s_network_count;
    }

    secure_bootstrap_network_t updated[SECURE_BOOTSTRAP_MAX_NETWORKS] = {0};
    size_t updated_count = 0U;
    for (uint16_t index = 0U; index < fetched; ++index) {
        updated_count = secure_bootstrap_network_insert(
            updated,
            updated_count,
            SECURE_BOOTSTRAP_MAX_NETWORKS,
            (const char *)records[index].ssid,
            records[index].rssi,
            map_auth(records[index].authmode));
    }

    memcpy(s_networks, updated, sizeof(s_networks));
    s_network_count = updated_count;
    secure_zero(updated, sizeof(updated));
    secure_zero(records, total * sizeof(*records));
    free(records);
    ESP_LOGI(TAG, "WIFI_TRACE scan_results_consumed count=%u", (unsigned)s_network_count);
    return s_network_count;
}

static const secure_bootstrap_network_t *find_scanned_network(const char *ssid)
{
    if (ssid == NULL || ssid[0] == '\0') return NULL;
    for (size_t index = 0U; index < s_network_count; ++index) {
        if (strcmp(s_networks[index].ssid, ssid) == 0) return &s_networks[index];
    }
    return NULL;
}

static bool request_uses_setup_ap(httpd_req_t *req)
{
    const bool request_valid = req != NULL;
    const bool ap_netif_valid = s_ap_netif != NULL;
    if (!request_valid || !ap_netif_valid) {
        ESP_LOGI(TAG, "PORTAL_ROUTE request_valid=%s ap_netif_valid=%s",
                 request_valid ? "true" : "false",
                 ap_netif_valid ? "true" : "false");
        return false;
    }

    int sockfd = httpd_req_to_sockfd(req);
    ESP_LOGI(TAG, "PORTAL_ROUTE sockfd_valid=%s", sockfd >= 0 ? "true" : "false");
    if (sockfd < 0) return false;

    struct sockaddr_storage local = {0};
    socklen_t local_len = sizeof(local);
    int socket_result = getsockname(sockfd, (struct sockaddr *)&local, &local_len);
    ESP_LOGI(TAG, "PORTAL_ROUTE getsockname_result=%d", socket_result);
    if (socket_result != 0) return false;

    ESP_LOGI(TAG, "PORTAL_ROUTE local_family=%d", (int)local.ss_family);

    esp_netif_ip_info_t ap_ip = {0};
    esp_err_t ap_ip_result = esp_netif_get_ip_info(s_ap_netif, &ap_ip);
    ESP_LOGI(TAG, "PORTAL_ROUTE ap_ip_result=%s", esp_err_to_name(ap_ip_result));
    if (ap_ip_result != ESP_OK) return false;

    uint32_t local_ipv4 = 0U;
    bool comparable_ipv4 = false;

    if (local.ss_family == AF_INET) {
        const struct sockaddr_in *local_v4 = (const struct sockaddr_in *)&local;
        local_ipv4 = local_v4->sin_addr.s_addr;
        comparable_ipv4 = true;
    } else if (local.ss_family == AF_INET6) {
        const struct sockaddr_in6 *local_v6 = (const struct sockaddr_in6 *)&local;
        const uint8_t *address = local_v6->sin6_addr.s6_addr;
        const bool ipv4_mapped =
            address[0] == 0U && address[1] == 0U &&
            address[2] == 0U && address[3] == 0U &&
            address[4] == 0U && address[5] == 0U &&
            address[6] == 0U && address[7] == 0U &&
            address[8] == 0U && address[9] == 0U &&
            address[10] == 0xffU && address[11] == 0xffU;
        ESP_LOGI(TAG, "PORTAL_ROUTE ipv4_mapped=%s", ipv4_mapped ? "true" : "false");
        if (ipv4_mapped) {
            memcpy(&local_ipv4, &address[12], sizeof(local_ipv4));
            comparable_ipv4 = true;
        }
    }

    if (!comparable_ipv4) {
        ESP_LOGI(TAG, "PORTAL_ROUTE setup_ap_match=false");
        return false;
    }

    const bool setup_ap_match = local_ipv4 == ap_ip.ip.addr;
    ESP_LOGI(TAG, "PORTAL_ROUTE setup_ap_match=%s", setup_ap_match ? "true" : "false");
    return setup_ap_match;
}

static const char *security_data_value(secure_bootstrap_wifi_security_t security)
{
    return security == SECURE_BOOTSTRAP_WIFI_SECURITY_OPEN ? "open" : "secured";
}

static esp_err_t send_network_options(httpd_req_t *req)
{
    esp_err_t result = httpd_resp_sendstr_chunk(
        req, "<option value=\"\" selected disabled>Välj ett nätverk</option>");
    if (result != ESP_OK) return result;

    for (size_t index = 0U; index < s_network_count; ++index) {
        char escaped[192];
        if (!secure_bootstrap_html_escape(s_networks[index].ssid, escaped, sizeof(escaped))) continue;
        char option[352];
        int written = snprintf(
            option,
            sizeof(option),
            "<option value=\"%s\" data-security=\"%s\">%s - %s signal - %s</option>",
            escaped,
            security_data_value(s_networks[index].security),
            escaped,
            secure_bootstrap_signal_label(s_networks[index].rssi),
            secure_bootstrap_security_label(s_networks[index].security));
        if (written > 0 && (size_t)written < sizeof(option)) {
            result = httpd_resp_sendstr_chunk(req, option);
            if (result != ESP_OK) return result;
        }
    }

    return httpd_resp_sendstr_chunk(
        req,
        "<option value=\"__manual__\" data-security=\"manual\">Annat nätverk...</option>");
}

