lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static esp_err_t networks_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html; charset=utf-8");
    ESP_RETURN_ON_ERROR(send_network_options(req), TAG, "network options");
    return httpd_resp_sendstr_chunk(req, NULL);
}

static esp_err_t root_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "PORTAL_ROOT begin");
    httpd_resp_set_type(req, "text/html; charset=utf-8");
    char escaped_code[64] = {0};
    const bool setup_ap_request = request_uses_setup_ap(req);
    ESP_LOGI(TAG, "PORTAL_ROOT setup_ap_request=%s",
             setup_ap_request ? "true" : "false");
    if (setup_ap_request) {
        if (!secure_bootstrap_html_escape(s_code.code, escaped_code, sizeof(escaped_code))) {
            escaped_code[0] = '\0';
        }
    }
    esp_err_t result = httpd_resp_sendstr_chunk(req,
        "<!doctype html><html lang=\"sv\"><head><meta charset=\"UTF-8\">"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<title>Wi-Fi</title><style>");
    if (result != ESP_OK) return result;
    result = httpd_resp_sendstr_chunk(req, portal_shared_css());
    if (result != ESP_OK) return result;
    result = httpd_resp_sendstr_chunk(req,
        "</style></head><body><main>"
        "<h1>Homey Panel Wi-Fi</h1><form id=wifi-form method=post action=/wifi novalidate>"
        "<label>Panelkod<input id=code name=code type=password required autocomplete=off value=\"");
    ESP_LOGI(TAG, "PORTAL_ROOT chunk=prefix result=%s", esp_err_to_name(result));
    if (result != ESP_OK) return result;

    const bool code_present = escaped_code[0] != '\0';
    ESP_LOGI(TAG, "PORTAL_ROOT code_present=%s", code_present ? "true" : "false");
    if (code_present) {
        result = httpd_resp_sendstr_chunk(req, escaped_code);
        ESP_LOGI(TAG, "PORTAL_ROOT chunk=code result=%s", esp_err_to_name(result));
        secure_zero(escaped_code, sizeof(escaped_code));
        if (result != ESP_OK) return result;
    } else {
        ESP_LOGI(TAG, "PORTAL_ROOT chunk=code skipped=true");
    }

    result = httpd_resp_sendstr_chunk(req,
        "\"><span id=code-help class=help></span></label>"
        "<label>Nätverk<select name=ssid id=ssid required>");
    ESP_LOGI(TAG, "PORTAL_ROOT chunk=after_code result=%s", esp_err_to_name(result));
    if (result != ESP_OK) return result;

    result = send_network_options(req);
    ESP_LOGI(TAG, "PORTAL_ROOT chunk=network_options result=%s", esp_err_to_name(result));
    if (result != ESP_OK) return result;

    result = httpd_resp_sendstr_chunk(req,
        "</select><span id=network-help class=help></span></label>"
        "<div id=manual hidden><label>SSID<input id=manual-ssid name=manual_ssid maxlength=32 autocomplete=off>"
        "<span id=manual-help class=help></span></label>"
        "<label class=check><input id=manual-open name=manual_open type=checkbox value=1>Detta är ett öppet nätverk</label></div>"
        "<label>Lösenord<input id=password name=password type=password maxlength=63 autocomplete=new-password>"
        "<span id=password-help class=help></span></label>"
        "<button id=connect type=submit disabled>Anslut panelen till valt nätverk</button></form>"
        "<script>const f=document.getElementById('wifi-form'),c=document.getElementById('code'),s=document.getElementById('ssid'),"
        "m=document.getElementById('manual'),ms=document.getElementById('manual-ssid'),mo=document.getElementById('manual-open'),"
        "p=document.getElementById('password'),b=document.getElementById('connect'),ch=document.getElementById('code-help'),"
        "nh=document.getElementById('network-help'),mh=document.getElementById('manual-help'),ph=document.getElementById('password-help');"
        "const bytes=v=>new TextEncoder().encode(v).length;function validate(){const o=s.options[s.selectedIndex],manual=s.value==='__manual__',"
        "open=manual?mo.checked:(o&&o.dataset.security==='open'),codeOk=c.value.trim().length>0,networkOk=s.value!==''&&(!manual||bytes(ms.value)>0&&bytes(ms.value)<=32);"
        "m.hidden=!manual;mo.disabled=!manual;p.readOnly=open;if(open&&p.value){p.value=''}const n=bytes(p.value),passOk=open?n===0:n>=8&&n<=63;"
        "ch.textContent=codeOk?'':'Ange panelkoden';nh.textContent=s.value?'':'Välj ett nätverk';"
        "mh.textContent=manual&&!networkOk?'Ange nätverksnamnet':'';ph.textContent=open?'Öppet nätverk - inget lösenord krävs':"
        "(n===0?'Ange ett lösenord med 8-63 tecken':(n<8?'Lösenordet är för kort':(n>63?'Lösenordet får innehålla högst 63 tecken':'')));"
        "b.disabled=!(codeOk&&networkOk&&passOk)}[c,s,ms,mo,p].forEach(e=>{e.addEventListener('input',validate);e.addEventListener('change',validate)});validate();</script>"
        "</main></body></html>");
    ESP_LOGI(TAG, "PORTAL_ROOT chunk=body result=%s", esp_err_to_name(result));
    if (result != ESP_OK) return result;

    result = httpd_resp_sendstr_chunk(req, NULL);
    ESP_LOGI(TAG, "PORTAL_ROOT chunk=finish result=%s", esp_err_to_name(result));
    if (result == ESP_OK) ESP_LOGI(TAG, "PORTAL_ROOT complete");
    return result;
}

static bool is_hex(char c) { return (c >= '0' && c <= '9') || (c >= 'a' && c <= 'f') || (c >= 'A' && c <= 'F'); }
static unsigned hexval(char c) { if (c <= '9') return (unsigned)(c - '0'); if (c <= 'F') return (unsigned)(c - 'A' + 10); return (unsigned)(c - 'a' + 10); }
static bool decode(char *dst, size_t cap, const char *src) { size_t d=0; for(size_t i=0; src[i]; ++i){ if(d+1>=cap)return false; if(src[i]=='+')dst[d++]=' '; else if(src[i]=='%'&&is_hex(src[i+1])&&is_hex(src[i+2])){dst[d++]=(char)((hexval(src[i+1])<<4)|hexval(src[i+2]));i+=2;} else dst[d++]=src[i]; } dst[d]=0; return true; }
static bool form_value(const char *body,const char *key,char *out,size_t cap){ size_t k=strlen(key); const char *p=body; while(p&&*p){ if((p==body||p[-1]=='&')&&strncmp(p,key,k)==0&&p[k]=='='){const char *v=p+k+1,*e=strchr(v,'&');size_t n=e?(size_t)(e-v):strlen(v);char enc[192];if(n>=sizeof(enc))return false;memcpy(enc,v,n);enc[n]=0;bool ok=decode(out,cap,enc);secure_zero(enc,sizeof(enc));return ok;} p=strchr(p,'&');if(p)++p;} return false; }

