lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static esp_err_t send_html_error(
    httpd_req_t *req,
    httpd_err_code_t status,
    const char *message)
{
    httpd_resp_set_type(req, "text/html; charset=utf-8");
    return httpd_resp_send_err(req, status, message);
}

static esp_err_t send_candidate_status_page(
    httpd_req_t *req,
    bool saved_config_present)
{
    static const char page_with_restore[] =
        "<!doctype html><html lang=\"sv\"><head><meta charset=\"UTF-8\">"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<title>Nätverket testas</title>"
        "<style>body{font:18px system-ui;max-width:34rem;margin:2rem auto;padding:1rem;"
        "background:#f6f8fb;color:#16202a}main{background:#fff;border-radius:1rem;"
        "padding:1.4rem;box-shadow:0 .3rem 1.2rem rgba(0,0,0,.08)}h1{margin-top:0}"
        "p{line-height:1.5}</style></head><body><main><h1>Nätverket testas</h1>"
        "<p>Panelen försöker ansluta med de nya inställningarna.</p>"
        "<p>Du kan nu återgå till panelen. Om anslutningen misslyckas återställs "
        "den tidigare Wi-Fi-konfigurationen automatiskt.</p></main></body></html>";
    static const char page_without_restore[] =
        "<!doctype html><html lang=\"sv\"><head><meta charset=\"UTF-8\">"
        "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
        "<title>Nätverket testas</title>"
        "<style>body{font:18px system-ui;max-width:34rem;margin:2rem auto;padding:1rem;"
        "background:#f6f8fb;color:#16202a}main{background:#fff;border-radius:1rem;"
        "padding:1.4rem;box-shadow:0 .3rem 1.2rem rgba(0,0,0,.08)}h1{margin-top:0}"
        "p{line-height:1.5}</style></head><body><main><h1>Nätverket testas</h1>"
        "<p>Panelen försöker ansluta med de nya inställningarna.</p>"
        "<p>Du kan nu återgå till panelen. Om anslutningen misslyckas kan du "
        "försöka igen från panelens installationsläge.</p></main></body></html>";

    httpd_resp_set_type(req, "text/html; charset=utf-8");
    return httpd_resp_sendstr(
        req,
        saved_config_present ? page_with_restore : page_without_restore);
}

static esp_err_t wifi_handler(httpd_req_t *req)
{
    if (req->content_len <= 0 || req->content_len >= MAX_FORM_BODY) {
        return send_html_error(req, HTTPD_400_BAD_REQUEST, "Ogiltigt formulär");
    }
    char body[MAX_FORM_BODY] = {0};
    int got = httpd_req_recv(req, body, req->content_len);
    if (got <= 0) return ESP_FAIL;
    body[got] = 0;

    char code[32] = {0};
    char selected[33] = {0};
    char manual[33] = {0};
    char password[65] = {0};
    char manual_open_value[4] = {0};
    bool parsed = form_value(body, "code", code, sizeof(code)) &&
                  form_value(body, "ssid", selected, sizeof(selected)) &&
                  form_value(body, "password", password, sizeof(password));
    (void)form_value(body, "manual_ssid", manual, sizeof(manual));
    bool manual_open = form_value(body, "manual_open", manual_open_value, sizeof(manual_open_value)) &&
                       strcmp(manual_open_value, "1") == 0;
    secure_zero(body, sizeof(body));
    secure_zero(manual_open_value, sizeof(manual_open_value));
    if (!parsed || code[0] == '\0') goto invalid;

    bool is_manual = strcmp(selected, "__manual__") == 0;
    const secure_bootstrap_network_t *scanned = is_manual ? NULL : find_scanned_network(selected);
    const char *ssid = is_manual ? manual : selected;
    size_t ssid_len = strlen(ssid);
    if (ssid_len == 0U || ssid_len > 32U || (!is_manual && scanned == NULL)) goto invalid;

    bool open_network = is_manual
        ? manual_open
        : scanned->security == SECURE_BOOTSTRAP_WIFI_SECURITY_OPEN;
    size_t password_len = strlen(password);
    if ((open_network && password_len != 0U) ||
        (!open_network && (password_len < 8U || password_len > 63U))) goto invalid;

    secure_bootstrap_status_t verified = secure_bootstrap_code_verify_and_consume(&s_code, code, now_s());
    secure_zero(code, sizeof(code));
    if (verified != SECURE_BOOTSTRAP_OK) goto forbidden;
    ESP_LOGI(TAG, "WIFI_PROVISIONING code_consumed=true candidate_session_active=true");

    memset(&s_candidate_config, 0, sizeof(s_candidate_config));
    int ssid_written = snprintf(
        (char *)s_candidate_config.sta.ssid,
        sizeof(s_candidate_config.sta.ssid),
        "%s",
        ssid);
    int password_written = snprintf(
        (char *)s_candidate_config.sta.password,
        sizeof(s_candidate_config.sta.password),
        "%s",
        password);
    if (ssid_written < 0 || (size_t)ssid_written >= sizeof(s_candidate_config.sta.ssid) ||
        password_written < 0 || (size_t)password_written >= sizeof(s_candidate_config.sta.password)) goto invalid;
    s_candidate_config.sta.threshold.authmode = WIFI_AUTH_OPEN;

    secure_zero(selected, sizeof(selected));
    secure_zero(manual, sizeof(manual));
    secure_zero(password, sizeof(password));
    esp_err_t disconnect_err = esp_wifi_disconnect();
    if (disconnect_err != ESP_OK && disconnect_err != ESP_ERR_WIFI_NOT_CONNECT) {
        ESP_LOGW(TAG, "Candidate disconnect failed: %s", esp_err_to_name(disconnect_err));
        return send_html_error(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Kunde inte förbereda nätverkstestet");
    }
    ESP_RETURN_ON_ERROR(esp_wifi_set_storage(WIFI_STORAGE_RAM), TAG, "candidate RAM");
    ESP_RETURN_ON_ERROR(esp_wifi_set_config(WIFI_IF_STA, &s_candidate_config), TAG, "candidate config");
    s_candidate_valid = true;
    (void)apply_actions(secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_CANDIDATE_SUBMITTED));
    return send_candidate_status_page(req, s_wifi.saved_config_present);

invalid:
    secure_zero(code, sizeof(code));
    secure_zero(selected, sizeof(selected));
    secure_zero(manual, sizeof(manual));
    secure_zero(password, sizeof(password));
    return send_html_error(req, HTTPD_400_BAD_REQUEST, "Ogiltiga formulärfält");
forbidden:
    secure_zero(selected, sizeof(selected));
    secure_zero(manual, sizeof(manual));
    secure_zero(password, sizeof(password));
    return send_html_error(req, HTTPD_403_FORBIDDEN, "Felaktig eller utgången panelkod");
}

static esp_err_t status_handler(httpd_req_t *req) { char json[192]; int n=snprintf(json,sizeof(json),"{\"state\":%u,\"ip_obtained\":%s,\"oauth_locked\":true}",(unsigned)s_wifi.state,s_ip_obtained?"true":"false"); httpd_resp_set_type(req,"application/json"); return httpd_resp_send(req,json,n); }
static esp_err_t server_start(void)
{
    httpd_config_t cfg=HTTPD_DEFAULT_CONFIG(); cfg.max_uri_handlers=20;
    ESP_LOGI(TAG, "WIFI_TRACE http_start_begin");
    esp_err_t http_start_err = httpd_start(&s_server, &cfg);
    ESP_LOGI(TAG, "WIFI_TRACE http_start_end result=%s", esp_err_to_name(http_start_err));
    ESP_RETURN_ON_ERROR(http_start_err, TAG, "server");
    const httpd_uri_t root={.uri="/",.method=HTTP_GET,.handler=root_handler}; const httpd_uri_t networks={.uri="/networks",.method=HTTP_GET,.handler=networks_handler}; const httpd_uri_t wifi={.uri="/wifi",.method=HTTP_POST,.handler=wifi_handler}; const httpd_uri_t status={.uri="/status",.method=HTTP_GET,.handler=status_handler};
    ESP_RETURN_ON_ERROR(httpd_register_uri_handler(s_server,&root),TAG,"root"); ESP_RETURN_ON_ERROR(httpd_register_uri_handler(s_server,&networks),TAG,"networks"); ESP_RETURN_ON_ERROR(httpd_register_uri_handler(s_server,&wifi),TAG,"wifi"); return httpd_register_uri_handler(s_server,&status);
}

static esp_err_t ensure_homey_server(void)
{
    if (s_server == NULL) {
        ESP_RETURN_ON_ERROR(server_start(), TAG, "HTTP server");
        s_homey_handlers_registered = false;
    }
    if (!s_homey_handlers_registered) {
        phone_provisioning_set_display_callback(set_display_text);
        phone_provisioning_set_portal_css(portal_shared_css());
        ESP_RETURN_ON_ERROR(phone_provisioning_register_handlers(s_server), TAG, "Homey provisioning handlers");
        s_homey_handlers_registered = true;
    }
    return ESP_OK;
}

static void wifi_event(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg; (void)data;
    if (base == WIFI_EVENT && id == WIFI_EVENT_SCAN_DONE) {
        ESP_LOGI(TAG, "WIFI_TRACE scan_done_event");
        (void)consume_network_scan_results();
        return;
    }
    if (s_persist_active && s_persist_stage != WIFI_PERSIST_STAGE_VERIFY_CONNECT) {
        ESP_LOGI(TAG, "WIFI_PERSIST event_suppressed=%ld", (long)id);
        return;
    }
    if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        const bool persist_verify = s_persist_active && s_persist_stage == WIFI_PERSIST_STAGE_VERIFY_CONNECT;
        const bool expected_state = s_wifi.state == SECURE_BOOTSTRAP_WIFI_CONNECTING_SAVED ||
            s_wifi.state == SECURE_BOOTSTRAP_WIFI_CONNECTING_CANDIDATE;
        if (!persist_verify && !expected_state) {
            ESP_LOGW(TAG, "WIFI_GOT_IP ignored=true state=%u", (unsigned)s_wifi.state);
            return;
        }
        s_ip_obtained = true;
        if (persist_verify) {
            uint32_t actions = secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_PERSIST_VERIFY_GOT_IP);
            s_candidate_valid = false;
            secure_zero(&s_candidate_config, sizeof(s_candidate_config));
            (void)backup_clear();
            legacy_sentinel_clear();
            s_persist_active = false;
            s_persist_task_scheduled = false;
            s_persist_stage = WIFI_PERSIST_STAGE_IDLE;
            ESP_LOGI(TAG, "WIFI_PERSIST complete");
            ESP_LOGI(TAG, "WIFI_ONLINE persistent_saved_connect=true");
            (void)apply_actions(actions);
            return;
        }
        bool candidate = s_wifi.state == SECURE_BOOTSTRAP_WIFI_CONNECTING_CANDIDATE;
        uint32_t actions = secure_bootstrap_wifi_transition(
            &s_wifi,
            candidate ? SECURE_BOOTSTRAP_WIFI_EVENT_CANDIDATE_GOT_IP : SECURE_BOOTSTRAP_WIFI_EVENT_GOT_IP);
        ESP_LOGI(TAG, "WIFI_GOT_IP commit_requested=%s", candidate ? "true" : "false");
        (void)apply_actions(actions);
        if (!candidate) ESP_LOGI(TAG, "WIFI_ONLINE persistent_saved_connect=false");
        return;
    }
    if (base == WIFI_EVENT && id == WIFI_EVENT_STA_DISCONNECTED) {
        s_ip_obtained = false;
        if (s_persist_active && s_persist_stage == WIFI_PERSIST_STAGE_VERIFY_CONNECT) {
            (void)secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_PERSIST_VERIFY_FAILED);
            esp_err_t err = rollback_once();
            if (err == ESP_OK) (void)secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_ROLLBACK_OK);
            else {
                (void)secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_ROLLBACK_FAILED);
                if (esp_wifi_start() == ESP_OK) (void)open_provisioning();
            }
            s_persist_active = false;
            return;
        }
        if (s_wifi.state == SECURE_BOOTSTRAP_WIFI_CONNECTING_SAVED ||
            s_wifi.state == SECURE_BOOTSTRAP_WIFI_CONNECTING_CANDIDATE ||
            s_wifi.state == SECURE_BOOTSTRAP_WIFI_ONLINE) {
            uint32_t actions = secure_bootstrap_wifi_transition(&s_wifi, SECURE_BOOTSTRAP_WIFI_EVENT_DISCONNECTED);
            (void)apply_actions(actions);
            ESP_LOGW(TAG, "WIFI_DISCONNECTED state=%u display_unchanged=true", (unsigned)s_wifi.state);
        }
    }
}

