lillknurra/ESP32-Homey-Wall-Panel/components/secure_bootstrap/secure_bootstrap_esp.c
static void poll_homey_dashboard_if_due(uint64_t now_ms)
{
    if (s_panel_ui == NULL) {
        return;
    }

    if (s_homey_dashboard_last_poll_ms != 0U &&
        now_ms - s_homey_dashboard_last_poll_ms <
            HOMEY_DASHBOARD_POLL_INTERVAL_MS) {
        return;
    }
    s_homey_dashboard_last_poll_ms = now_ms;

    panel_homey_read_snapshot_t snapshot;
    memset(&snapshot, 0, sizeof(snapshot));
    panel_homey_read_result_t snapshot_result =
        athom_cloud_copy_device_snapshot(now_ms, &snapshot);

    const panel_homey_dashboard_apply_result_t apply_result =
        panel_homey_dashboard_apply_snapshot(
            snapshot_result,
            snapshot_result == PANEL_HOMEY_READ_OK ? &snapshot : NULL,
            now_ms,
            &s_homey_dashboard_state);

    if (!bsp_display_lock(50)) {
        return;
    }

    bool model_changed = false;
    if (apply_result == PANEL_HOMEY_DASHBOARD_APPLY_UPDATED) {
        model_changed = panel_ui_apply_homey_dashboard_state(
            &s_panel_model,
            &s_homey_dashboard_state);
    }
    const bool favorites_changed =
        panel_homey_favorites_apply_ui_model(&s_panel_model);
    if (model_changed || favorites_changed) {
        (void)panel_ui_refresh(s_panel_ui);
    }

    bsp_display_unlock();
}

static void rotation_task(void *arg)
{
    (void)arg;
    for (;;) {
        if (s_wifi.state == SECURE_BOOTSTRAP_WIFI_PROVISIONING) {
            if (secure_bootstrap_code_rotation_due(&s_code, now_s())) {
                secure_bootstrap_code_t next = {0};
                uint8_t random_bytes[SECURE_BOOTSTRAP_CODE_LEN];
                esp_fill_random(random_bytes, sizeof(random_bytes));
                secure_bootstrap_status_t generated = secure_bootstrap_code_generate(&next, now_s(), random_bytes, sizeof(random_bytes));
                secure_zero(random_bytes, sizeof(random_bytes));
                if (generated == SECURE_BOOTSTRAP_OK && configure_access_point(next.code) == ESP_OK) {
                    secure_bootstrap_code_wipe(&s_code);
                    s_code = next;
                    memset(&next, 0, sizeof(next));
                    set_display_text(
                        "Säker Wi-Fi-installation",
                        "Anslut till HomeyPanel-Setup\nÖppna 192.168.4.1",
                        s_code.code);
                    ESP_LOGI(TAG, "WIFI_PROVISIONING code_rotation_commit=true");
                } else {
                    secure_bootstrap_code_wipe(&next);
                    ESP_LOGW(TAG, "WIFI_PROVISIONING code_rotation_commit=false old_session_preserved=true");
                }
            }
            refresh_code_countdown();
        } else {
            s_last_code_countdown_s = -1;
        }
        const uint64_t panel_now_ms =
            (uint64_t)(esp_timer_get_time() / 1000LL);
        poll_homey_dashboard_if_due(panel_now_ms);
        update_homey_data_boot_view(panel_now_ms);
        if (s_panel_ui != NULL && bsp_display_lock(50)) {
            const panel_power_state_t panel_power_before = s_panel_model.power_state;
            if (panel_ui_update_inactivity(s_panel_ui, panel_now_ms)) {
                const uint64_t idle_ms = panel_now_ms >= s_panel_model.last_activity_ms
                    ? panel_now_ms - s_panel_model.last_activity_ms : 0U;
                ESP_LOGI(TAG,
                    "PANEL_POWER transition=%u->%u idle_ms=%llu dim_threshold_ms=%llu off_threshold_ms=%llu",
                    (unsigned)panel_power_before, (unsigned)s_panel_model.power_state,
                    (unsigned long long)idle_ms,
                    (unsigned long long)s_panel_model.settings.dim_after_seconds * 1000ULL,
                    (unsigned long long)s_panel_model.settings.off_after_seconds * 1000ULL);
            }
            panel_display_perf_log_if_due();
            bsp_display_unlock();
        }
        vTaskDelay(pdMS_TO_TICKS(ROTATION_POLL_INTERVAL_MS));
    }
}
static esp_err_t wipe_homey_account_state(void)
{
    athom_cloud_alias_invalidate();

    esp_err_t first_error = ESP_OK;
    panel_homey_alias_store_result_t alias_result =
        panel_homey_alias_store_wipe();
    if (alias_result != PANEL_HOMEY_ALIAS_STORE_OK) {
        first_error = ESP_FAIL;
    }

    esp_err_t auth_result = athom_auth_store_wipe();
    if (auth_result != ESP_OK && first_error == ESP_OK) {
        first_error = auth_result;
    }

    return first_error;
}

static void wipe_task(void *arg)
{
    (void)arg; gpio_config_t io={.pin_bit_mask=1ULL<<BOOT_BUTTON_GPIO,.mode=GPIO_MODE_INPUT,.pull_up_en=GPIO_PULLUP_ENABLE}; ESP_ERROR_CHECK(gpio_config(&io)); secure_bootstrap_wipe_tracker_t t={0};
    for(;;){ if(secure_bootstrap_wipe_tracker_update(&t,gpio_get_level(BOOT_BUTTON_GPIO)==0,esp_timer_get_time()/1000LL)){ ESP_LOGW(TAG,"BOOTSTRAP_PHYSICAL_REPROVISION accepted=true"); esp_err_t homey_wipe_error = wipe_homey_account_state(); if (homey_wipe_error != ESP_OK) { ESP_LOGW(TAG, "HOMEY_ACCOUNT_WIPE result=%s", esp_err_to_name(homey_wipe_error)); } (void)backup_clear(); legacy_sentinel_clear(); ESP_ERROR_CHECK(esp_wifi_restore()); esp_restart(); } vTaskDelay(pdMS_TO_TICKS(WIPE_POLL_INTERVAL_MS)); }
}

secure_bootstrap_status_t secure_bootstrap_start(void)
{
    secure_bootstrap_wifi_context_init(&s_wifi); if(display_init()!=ESP_OK)return SECURE_BOOTSTRAP_ERR_PLATFORM;
    set_display_text("Ansluter till Wi-Fi...", "Kontrollerar sparad konfiguration", NULL);
    ESP_ERROR_CHECK(esp_netif_init()); ESP_ERROR_CHECK(esp_event_loop_create_default()); s_ap_netif=esp_netif_create_default_wifi_ap(); s_sta_netif=esp_netif_create_default_wifi_sta(); if(!s_ap_netif||!s_sta_netif)return SECURE_BOOTSTRAP_ERR_PLATFORM;
    wifi_init_config_t init=WIFI_INIT_CONFIG_DEFAULT();
    s_wifi_nvs_enabled = init.nvs_enable != 0;
    ESP_LOGI(TAG, "WIFI_BOOT nvs_enabled=%s", s_wifi_nvs_enabled ? "true" : "false");
    legacy_sentinel_clear();
    ESP_ERROR_CHECK(esp_wifi_init(&init)); ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT,ESP_EVENT_ANY_ID,wifi_event,NULL)); ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT,IP_EVENT_STA_GOT_IP,wifi_event,NULL));
    esp_err_t storage_err = esp_wifi_set_storage(WIFI_STORAGE_FLASH);
    ESP_LOGI(TAG, "WIFI_BOOT storage_result=%s", esp_err_to_name(storage_err));
    ESP_ERROR_CHECK(storage_err);
    memset(&s_saved_config,0,sizeof(s_saved_config));
    esp_err_t get_config_err = esp_wifi_get_config(WIFI_IF_STA,&s_saved_config);
    ESP_LOGI(TAG, "WIFI_BOOT get_config_result=%s", esp_err_to_name(get_config_err));
    ESP_ERROR_CHECK(get_config_err);
    bool ssid_first_byte_zero = s_saved_config.sta.ssid[0] == 0U;
    bool ssid_any_nonzero = ssid_has_any_nonzero(&s_saved_config);
    ESP_LOGI(TAG, "WIFI_BOOT ssid_first_byte_zero=%s", ssid_first_byte_zero ? "true" : "false");
    ESP_LOGI(TAG, "WIFI_BOOT ssid_any_nonzero=%s", ssid_any_nonzero ? "true" : "false");
    s_saved_valid=has_saved_ssid(&s_saved_config);
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    uint32_t actions=secure_bootstrap_wifi_transition(&s_wifi,s_saved_valid?SECURE_BOOTSTRAP_WIFI_EVENT_BOOT_WITH_SAVED:SECURE_BOOTSTRAP_WIFI_EVENT_BOOT_WITHOUT_SAVED);
    ESP_LOGI(TAG, "WIFI_BOOT saved_config=%s", s_saved_valid ? "true" : "false");
    (void)apply_actions(actions);
    if (xTaskCreate(
            wipe_task,
            "physical_wipe",
            3072,
            NULL,
            5,
            NULL) != pdPASS) {
        return SECURE_BOOTSTRAP_ERR_PLATFORM;
    }
    if (xTaskCreate(
            rotation_task,
            "bootstrap_rotation",
            4096,
            NULL,
            5,
            NULL) != pdPASS) {
        return SECURE_BOOTSTRAP_ERR_PLATFORM;
    }
    ESP_LOGI(TAG,"BOOTSTRAP_READY saved_config=%s softap=%s oauth_locked=true",s_saved_valid?"true":"false",s_saved_valid?"false":"true"); return SECURE_BOOTSTRAP_OK;
}
#endif
